In [120]:
import pandas as pd

In [121]:
borough_prices = pd.read_csv('/Users/selina/neuefische/hh-23-1-airbnb/data/borough_costs_2022.csv')

In [122]:
borough_prices.head()

         London borough December 2022 December 2021 Difference
0  Barking and Dagenham      £362,054      £326,199     11.00%
1                Barnet      £595,486      £573,140      3.90%
2                Bexley      £416,060      £376,770     10.40%
3                 Brent      £566,795      £516,595      9.70%
4               Bromley      £523,365      £475,377     10.10%

In [123]:
borough_prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   London borough  33 non-null     object
 1   December 2022   33 non-null     object
 2   December 2021   33 non-null     object
 3   Difference      33 non-null     object
dtypes: object(4)
memory usage: 1.2+ KB

In [124]:
del borough_prices['December 2021']
del borough_prices['Difference']

In [125]:
borough_prices.head()

         London borough December 2022
0  Barking and Dagenham      £362,054
1                Barnet      £595,486
2                Bexley      £416,060
3                 Brent      £566,795
4               Bromley      £523,365

In [135]:
borough_prices['london_borough'].unique()

array(['Barking and Dagenham', 'Barnet', 'Bexley', 'Brent', 'Bromley',
       'Camden', 'City of London', 'Westminster', 'Croydon', 'Ealing',
       'Enfield', 'Greenwich', 'Hackney', 'Hammersmith and Fulham',
       'Haringey', 'Harrow', 'Havering', 'Hillingdon', 'Hounslow',
       'Islington', 'Kensington and Chelsea', 'Kingston upon Thames',
       'Lambeth', 'Lewisham', 'Merton', 'Newham', 'Redbridge',
       'Richmond upon Thames', 'Southwark', 'Sutton', 'Tower Hamlets',
       'Waltham Forest', 'Wandsworth'], dtype=object)

In [127]:
borough_prices['December 2022'] = borough_prices['December 2022'].str[1:]

In [128]:
borough_prices['December 2022'] = borough_prices['December 2022'].str.replace(',','')

In [129]:
borough_prices['December 2022'] = borough_prices['December 2022'].astype("int")

In [130]:
borough_prices = borough_prices.rename({'London borough': 'london_borough', 'December 2022': 'avg_house_price_22'}, axis=1)

In [136]:
borough_prices.head()

         london_borough  avg_house_price_22
0  Barking and Dagenham              362054
1                Barnet              595486
2                Bexley              416060
3                 Brent              566795
4               Bromley              523365

In [132]:
borough_prices['london_borough'] = borough_prices['london_borough'].str.replace('City of Westminster', 'Westminster')